app/controllers/games_controller.rb

  def new
    @game = Game.create!
---
INSERT INTO "games" ("created_at", "total_moves", "updated_at", "winner") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Dec 2012 23:40:57 UTC +00:00], ["total_moves", nil], ["updated_at", Wed, 12 Dec 2012 23:40:57 UTC +00:00], ["winner", nil]]

  def move
    @game = Game.current

    if @game.over?
      json_fail("Game Over","Reset pieces...") and return
    end

    fromI = params[:fromI].to_i
    toI = params[:toI].to_i

    fromX = fromI%8
    fromY = (fromI/8).to_i

    toX = toI%8
    toY = (toI/8).to_i

    m = @game.moves.new({
      :fromX => fromX,
      :fromY => fromY,
      :toX => toX,
      :toY => toY,
      :mover => params[:mover].to_i == 0 ? false : true
    })

    if m.save!
---
INSERT INTO "moves" ("capturedPiece", "created_at", "currentBoard", "fromX", "fromY", "game_id", "isCheck", "isCheckmate", "mover", "toX", "toY", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)